
local L,R='left','right'
--角色名用变量代替
local REIMU='reimu'
local MARISA='marisa'

local HALLU='Boss3'
local _tmp_char_info={
	--角色定义，包括：
	--pos 角色通常处于那一策，用L或R指代
	--emolist 角色表情信息列表
		--键值必须是string类型，指代表情类型，同时也是图片和文件名的一部分
		--表项的值是角色表情对应的气泡索引
	[HALLU]={pos=R,emolist={
		['faiil']=1,
		['laugh']=1,
		['normal']=1,
		['saying1']=1,
		['saying2']=1,
		['smile']=1,
		['taught1']=1,
		['taught2']=1,
		['unholdable']=1
		}
	}
}

--对话内容，如此一来写对话可完全简化为角色，表情和文字三项
local _tmp_dialog={
	--1代表第一个对话块
	--角色，表情，对话文字，对话气泡停留时长（帧）可不填
	[1]={
		{HALLU,'laugh','那边的巫女，我等了你很久了。'},
		{REIMU,'confused2','哈？你是谁？'},
		{REIMU,'selfconfidence2','主动在这里等着挨打的妖怪吗？'},
	},
	[2]={
		{HALLU,'smile','我的名字叫做哈琉希恩，是在此帮助你的神明。'},
		{REIMU,'scorn','神明？依我看，神明的气质丝毫没有，\n妖怪的气质倒是格外的突显。'},
		{REIMU,'selfconfidence1','即便是冒充神明，也不该在巫女的面前冒充。'},
		{HALLU,'taught1','作为侍奉神明的巫女，你的身上\n也没有丝毫巫女该有的气质呀。'},
		{REIMU,'speechless1','…………'},
		{HALLU,'smile','目前的你一定对这场异变毫无头绪吧。'},
		{HALLU,'smile','完全依靠着冲动的误打误撞是无论\n如何也触摸不到这场异变的核心的。'},
		{REIMU,'laugh3','梦是那么的虚无缥缈，就仿佛在空气中寻找灵一样。'},
		{REIMU,'laugh3','像这种与梦境相关的异变，无论如何也抓不住它的踪迹啊。'},
		{HALLU,'smile','那么抛弃了梦于现实，从它们之外\n的角度去观察这场异变如何？'},
		{HALLU,'saying1','身在山林中的人是看不见山林的样貌的，\n当你抛弃了二者，不就可以抓住整场异变了么？'},
		{HALLU,'saying2','当下的幻想乡现实与梦境已经交错缠绕了起来，\n就如同这森林中几乎无法理顺的藤曼一样。'},
		{HALLU,'taught2','而最快解决这些藤曼的方法，就是挣脱\n他们，再用一把烈火将它们统统燃尽。'},
		{REIMU,'pissedoff2','……哼，听起来净是一些妖怪口中传出来的歪门邪道。'},
		{REIMU,'pissedoff3','不要以为我会信了你所说的这些鬼话。'},
		{HALLU,'taught1','信与不信我你的事情，我只是在\n这里尽着我的本职工作而已。'},
		{HALLU,'unholdable','无论怎么说，彻底解决这场异\n变都需要依靠我的力量来砸烂二者。'},
		{HALLU,'taught2','但是现在看来被包裹在这片小小\n世界中的博丽巫女也不过如此嘛。'},
		{HALLU,'taught1','能够自由的飞翔于天空的你，\n就连展现在你面前的天空是否真实都不清楚。'},
		{REIMU,'rage','你在说什么？'},
		},
	[3]={
		{HALLU,'taught2','你知道吗？你那所谓直觉和\n灵敏的感官一直在欺骗你自己。'},
		{HALLU,'taught1','正是幻想乡将你隔离于现实之外，\n使得你自以为是的在这幻想的天空中飞行。'},
		{REIMU,'rage','满嘴胡话的妖怪，我务必需要退治掉你了！'},
		{HALLU,'unholdable','正好，就然我打破虚掩在你\n面前的虚假天空，让你见识一下真正的世界吧！'},
		--{REIMU,'smile','天空将在你面前崩离瓦解！'},
		},
	[4]={
		{HALLU,'faiil','还真是顽固的执念，我无论如何也矫正不了你了。'},
		{REIMU,'pissedoff1','危险的妖怪，差一点就\n把我迷惑住了，幸好及时解决掉了她。'},
		{REIMU,'ease3','接下来该如何是好呢？\n这种异变完全没有头绪，真叫人伤脑筋。'},
	},
	[100+1]={
		{HALLU,'smile','不要着急，有关于异变的一切很快就会平息。'},
		{MARISA,'confused2','是谁？'},
		{HALLU,'laugh','是前来帮助你的神灵哦。'},
		{MARISA,'confused','神灵？我可从来没有听说过这里有什么神灵。'},
		{HALLU,'saying2','毕竟你不是巫女，怎么会那么轻易的发现我的存在？'},
		{HALLU,'smile','我这是见到你陷入了困境才现身的。'},
		{MARISA,'mad','呵呵，是妖怪的话就尽快显出原形吧，\n不要在这里装做神明的样子。'}
			},
	[100+2]={
		{HALLU,'saying2','误会了，我叫哈琉希恩，\n是借由这次异变的力量诞生的神灵。'},
		{HALLU,'saying1','依靠我的力量，你便可以轻易的解决这场异变。'},
		{MARISA,'normal3','轻易解决异变？谁会相信你的鬼话。'},
		{MARISA,'normal3','令我如此焦头烂额的异变，\n你竟然以如此轻易的口气说出解决二字。'},
		{HALLU,'laugh','是哦，没有问题，只需要凭借我的力量。'},
		{MARISA,'say1','说来听听。'},
		{HALLU,'saying1','梦境与现实就如同镜中的世界与镜外的世界一样。'},
		{HALLU,'saying2','镜外的世界一旦发生细微的变化，\n那么镜中的世界立刻就是发生相应的改变。'},
		{HALLU,'normal','但是无论镜中的世界如何改变，\n镜外的世界却不受影响。'},
		{MARISA,'say2','呃……说的好像有几分道理，那么接下来呢？'},
		{HALLU,'saying1','但是现在镜外与镜内的世界发生了反转，\n所以之前所叙述的一切都反转了过来。'},
		{HALLU,'saying2','由此，成为镜外世界的梦境便可以\n轻易的修改镜内的现实世界了。'},
		{HALLU,'smile','这个异变一定是有人擅自反转了二者的地位。'},
		{MARISA,'normal3','…………'},
		{MARISA,'say1','这么说来，确实有符合这种能力的嫌疑犯啊。'},
		{MARISA,'say2','不过我们要怎么解决当下的事态呢？'},
		{HALLU,'unholdable','我们如果直接将镜子砸碎，那么镜内与镜外\n的概念便消失了，异变便可以平息下去。'},
		{HALLU,'taught1','这样就有机会揪出幕后黑手了。'},
		{MARISA,'say1','虽然听起来是不错的方案，但是总感到有些……'},
		{HALLU,'laugh','没有问题。'},
		{MARISA,'mad','刚刚就感到有问题，你是不是想利用我为你完成什么事情？'},
		{HALLU,'smile','怎么可能，我也是异变的受害者之一呢。'},
		{MARISA,'mad','受害者之一？刚刚还在说凭借着\n异变获得力量，这里又变成了受害者。'},
		{MARISA,'mad','自己戳穿了自己的谎言。'},
		{MARISA,'mad','从刚刚开始你就在这里把我诱导向你说的解决方案。'},
		{MARISA,'mad','幸好我即使戳穿了你，不然中了妖怪奸计\n的我不知道会面临什么样子的后果呢。'}
	},
	[100+3]={
		{HALLU,'unholdable','魔法是离不开充满魔力的土地的！'},
		{HALLU,'taught2','可是你脚踏的这片土地，真的拥有魔力吗？'},
		{HALLU,'taught1','或许它那由树木、灌木、杂草、蘑菇、苔藓\n披被的光鲜的虚假表面下就是一片毫无意义的土地'},
		{HALLU,'unholdable','比沙漠还要贫瘠，比月面还要贫瘠！'},
		{MARISA,'mad','你在讲什么？这样的森林明明摆\n在眼前，你却在否认它的存在！'},
		{HALLU,'taught1','眼见真的为实吗？至少我不是这么认为的。'},
		{HALLU,'taught2','或许你应该放下现在你所认为的一切来重新审视这片土地。'},
		{MARISA,'mad','不明所以的妖怪，见到自己被戳穿之后\n便开始胡言乱语，需要教训一顿了。'}
			},
	[100+4]={
		--{HALLU,'smile','看一看吧！你的心中究竟什么被麻痹了。'},
		--{HALLU,'smile','明明昨日的你还在为这贫瘠的土壤而苦恼呢！'},
		{MARISA,'ease','原来刚刚在路上遇到的那些家伙都是她制作的幻觉。'},
		{MARISA,'ease','能够迷幻人的可怕妖怪啊。'},
		{HALLU,'faiil','你亲手将解决异变的路径给摧毁掉了。'},
		{HALLU,'faiil','从现在开始你将会陷入绝境。'},
		{MARISA,'scorn','还在这里耍嘴上功夫。'},
		{MARISA,'normal3','不过她之前提到的镜面的反转…………'},
		{MARISA,'smile','是重要的线索呢。'}
		
	},


}

return _tmp_char_info,_tmp_dialog