
local L,R='left','right'
--角色名用变量代替
local REIMU='reimu'
local MARISA='marisa'

local MIO='Boss2'
local _tmp_char_info={
	--角色定义，包括：
	--pos 角色通常处于那一策，用L或R指代
	--emolist 角色表情信息列表
		--键值必须是string类型，指代表情类型，同时也是图片和文件名的一部分
		--表项的值是角色表情对应的气泡索引
	[MIO]={pos=R,emolist={
		['annoy1']=1,
		['annoy2']=1,
		['failed1']=1,
		['failed2']=1,
		['failed3']=1,
		['inflation1']=1,
		['inflation2']=1,
		['inflation3']=1,
		['normal']=1,
		['say']=1,
		['taunt']=1
		}
	}
}

--对话内容，如此一来写对话可完全简化为角色，表情和文字三项
local _tmp_dialog={
	--1代表第一个对话块
	--角色，表情，对话文字，对话气泡停留时长（帧）可不填
	[1]={
		{REIMU,'speechless2','没想到人类村落中会有这么多的妖怪大摇大摆的横行。'},
		{REIMU,'pissedoff1','这些烦人的家伙大概是想趁火打劫，\n将异变中的村落完全支配于恐惧之下。'},
		{REIMU,'confused1','是谁？'}
	},
	[2]={
		{REIMU,'confused2','所有人应该早就从这片危险区域疏散了才对，你是什么人？'}
	},
	[3]={		
	    {MIO,'annoy1','我是时松弥庭。'},
		{MIO,'annoy1','看你的这身打扮，应该是博丽神社的巫女吧？'},
		{REIMU,'pissedoff1','那是当然，但是你独自一人出\n现在这种地方，怎么看都是可疑的行为。'},
		{REIMU,'pissedoff1','难道你不应该去安全的区域避难吗？'},
		{MIO,'annoy2','那是胆小鬼才会去做的事情。'},
		{MIO,'inflation2','我们可都是在此解决扰人妖怪的人啊。'},
		{REIMU,'confused1','我们？莫非你是什么能人异士？'},
		{MIO,'inflation3','差不多，而且我要做的事不仅\n仅是解决这次异变这么简单。'},
		{MIO,'inflation3','我可是让悲惨的人类从妖怪的\n支配之下彻底摆脱出来！”'},
		{REIMU,'laugh3','你说什么？这是何等荒唐的理想。'},
		{MIO,'inflation1','原本我同村落当中大部分的\n人相同，不过是泛泛之辈而已。'},
		{MIO,'inflation2','但是借由这场异变，我从梦中得到了\n前所未有的强大能力——驱散心中恐惧的力量。'},
		{MIO,'inflation2','我挣脱了恐惧的枷锁之后，\n便看清了幻想乡中的人类是何等的悲惨。'},
		{MIO,'inflation2','于妖怪的支配之下苟活着的人们，\n没有任何的希望可言。'},
		{MIO,'inflation2','我尝试学习了退治妖怪的秘术，并且已经掌握了部分。'},
		{MIO,'inflation3','如此一来，我便拥有了与妖怪对抗的资本。'},
		{MIO,'inflation3','如果将村落中的人们聚集起来，\n有人之人传授他们退治妖怪的秘术于众人，'},
		{MIO,'inflation3','就足以让村落的得到摆脱妖怪支配的资本了。'},
		{REIMU,'speechless1','…………'},
		{REIMU,'scorn','哼，真实天真而又危险的想法。'},
		{REIMU,'scorn','仅仅只是学习了皮毛的你\n能否在妖怪面前活着都还是大问题。'},
		{REIMU,'yaowei','还大谈什么摆脱妖怪支配这种事情，\n倒是应了你那不怕恐惧的事情。'},
		{REIMU,'selfconfidence1','那么你从梦里……'}
	},
	[4]={		
		{MIO,'annoy2','罢了，没有人会相信我。'},
		{MIO,'annoy1','所有人都在被恐惧所束缚，\n即使是博丽的巫女也是一样。'},
		{MIO,'inflation3','不如我们用符卡规则来战斗一番，\n看看究竟谁才是真正站在真理一侧的人。'},
		{REIMU,'scorn','与我战斗？你是认真的？'},
		{MIO,'taunt','在符卡规则之下，即便我们之间有者相当\n大的实力差距，但我依然存在获胜的机会。'},
		{REIMU,'yaowei','既然你已经这么说了，那我就奉陪到底。'}
	},
	[5]={		
		{MIO,'failed1','啊——'},
		{REIMU,'selfconfidence2','怎么样，还能继续吗？'},
		{MIO,'failed3','已经倒下了……没想到你竟然如此的认真。”'},
		{REIMU,'selfconfidence1','伤的有些严重呢，是不是我下手有些重了点呀？'},
		{REIMU,'smile1','也罢，正好在这场异变解决之前，\n你就安安稳稳的呆在家里养伤吧。'},
		{MIO,'failed2','看来我还是学术不精，下次再挑战你就不会输的这样惨了。'},
		{REIMU,'speechless2','还想挑战我？'},
		{REIMU,'selfconfidence2','如果你遇到的不是我而是\n妖怪的话早就死无全尸了。'},
		{REIMU,'say1','还有一点，你的力量是怎么得到的？'},
		{MIO,'failed3','从梦中。'},
		{REIMU,'say3','这我知道，是什么样的梦？'},
		{MIO,'failed2','那是奇妙的梦，有者从未涉足过的高山群峦，还有……'},
		{MIO,'failed3','剩下的忘记了，梦不是那么清晰。'},
		{REIMU,'smile2','也就只能得到这一点情报了么？'}
	},
	[100+1]={
		{MARISA,'say2','呼，人类村落里的安全工作做的还不错么。'}
		},
	[100+2]={
		{MIO,'inflation1','那边的人，你也是留守在此的勇敢之士吗？'},
		{MARISA,'say3','勇敢之士？姑且算是吧。'},
		{MIO,'inflation3','哈哈，我就知道还有我的同道中人。'}
		},
	[100+3]={
		{MIO,'normal','我的名字叫做时松弥庭。'},
		{MIO,'normal','那些胆小的人都龟缩到安稳的区域里去了。'},
		{MIO,'taunt','没有人会考虑这些废弃的地方是否会被妖怪占据。'},
		{MARISA,'say2','这么说你不怕妖怪吗？'},
		{MIO,'taunt','怎么会，妖怪给我的恐惧早就烟消云散了。'},
		{MIO,'inflation3','我可是没有恐惧的人。'},
		{MARISA,'say2','没有恐惧…那岂不是很危险？'},
		{MIO,'say','危险？怎么会呢？'},
		{MIO,'inflation2','没有了恐惧，我就能够带领人们去与妖怪抗争了。'},
		{MARISA,'confused2','人类与妖怪进行抗争？'},
		{MARISA,'ease','谁会去做这种蠢事，怎么说都是死路一条吧。'},
		{MARISA,'say1','人类的力量即便是全部集结起来，\n也不能做到和妖怪进行争斗。'},
		{MIO,'taunt','切，你会产生这样的想法，\n不过是你心中的恐惧在作祟罢了。'},
		{MIO,'taunt','既然能在异变当中来到村落中的这种危险街道，\n看来你也不是什么泛泛之辈。'}
		},
	[100+4]={
		{MIO,'inflation3','就让你见识一下能驱逐恐惧之人的力量吧！'},
		{MARISA,'normal1','头一回见到这么好战的人类，有点意思。'},
		{MARISA,'laugh','那我也只好奉陪了。'}
		},
	[100+5]={
		{MIO,'failed1','好强，果然不是一般人，\n是靠着自己本身的强大而减弱的恐惧吗。'},
		{MARISA,'normal3','所以说，你连我都无法击败，\n更何况那些强大的妖怪呢？'},
		{MARISA,'say1','仅仅依靠不会恐惧这一点，\n还是无法与实力强大的妖怪抗衡的。'},
		{MIO,'failed3','虽然你这样说，但是依旧不能让我打消这个念头。'},
		{MIO,'failed3','人们的弱小是因为对妖怪的恐惧。'},
		{MIO,'failed3','龟缩在自己狭小的领地之中，\n祈求安定的人们根本无法变的强大。'},
		{MIO,'failed3','他们只能活在妖怪的恐惧之中。'},
		{MIO,'failed3','这样的恶性循环需要有人来打破。'},
		{MARISA,'awkward','真是可怕的思想，果真是没有恐惧的人呢。'},
		{MARISA,'normal3','若你是真的组织人们去对抗妖怪，\n整个村庄都说不定会因此毁掉啊。'},
		{MIO,'failed2','说起来，你那么强大，有没有与我同道的想法？'},
		{MARISA,'say1','我才没有那样的闲工夫。'},
		{MARISA,'say1','更何况现在我连居所都没有。'},
		{MIO,'failed2','你可以住在我这！'},
		{MARISA,'mad','住在这样鬼畜的房子里，\n我宁可再去神社守一晚上夜。'}
		
	}
	

}

return _tmp_char_info,_tmp_dialog